chartref/old/mongodbcluster1/b/rc1000-op1000/tc2/run1.txt
/usr/lib/jvm/java-11-openjdk-11.0.4.11-0.el7_6.x86_64//bin/java  -classpath /mnt/hdd2/nosql-prj/YCSB/YCSB/conf:/mnt/hdd2/nosql-prj/YCSB/YCSB/core/target/core-0.17.0-SNAPSHOT.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/mongodb-binding-0.17.0-SNAPSHOT.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/HdrHistogram-2.1.9.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/htrace-core4-4.2.0-incubating.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/logback-classic-1.1.2.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/logback-core-1.1.2.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/mongodb-async-driver-2.0.1.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/mongo-java-driver-3.8.0.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/slf4j-api-1.7.25.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/snappy-java-1.1.7.1.jar com.yahoo.ycsb.Client -t -db com.yahoo.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://172.16.13.26:27021 -P /mnt/hdd2/nosql-prj/YCSB/YCSB/workloads/workloadb -p recordcount=1000 -threads 2 -p operationcount=1000
mongo client connection created with mongodb://172.16.13.26:27021
[OVERALL], RunTime(ms), 1257
[OVERALL], Throughput(ops/sec), 795.5449482895783
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 7
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.5568814638027049
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 7
[TOTAL_GC_TIME_%], Time(%), 0.5568814638027049
[READ], Operations, 955
[READ], AverageLatency(us), 1825.2732984293193
[READ], MinLatency(us), 1258
[READ], MaxLatency(us), 43615
[READ], 95thPercentileLatency(us), 2271
[READ], 99thPercentileLatency(us), 2605
[READ], Return=OK, 955
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 868.0
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 1733
[CLEANUP], 95thPercentileLatency(us), 1733
[CLEANUP], 99thPercentileLatency(us), 1733
[UPDATE], Operations, 45
[UPDATE], AverageLatency(us), 1896.8
[UPDATE], MinLatency(us), 1255
[UPDATE], MaxLatency(us), 7103
[UPDATE], 95thPercentileLatency(us), 2591
[UPDATE], 99thPercentileLatency(us), 7103
[UPDATE], Return=OK, 45